In [1]:
import numpy as np
import pandas as pd
df = pd.read_csv('homeprices(dummy).csv')

In [2]:
df.head()

              town  area   price
0  monroe township  2600  550000
1  monroe township  3000  565000
2  monroe township  3200  610000
3  monroe township  3600  680000
4  monroe township  4000  725000

In [3]:
dummies = pd.get_dummies(df.town)
dummies

    monroe township  robinsville  west windsor
0                 1            0             0
1                 1            0             0
2                 1            0             0
3                 1            0             0
4                 1            0             0
5                 0            0             1
6                 0            0             1
7                 0            0             1
8                 0            0             1
9                 0            1             0
10                0            1             0
11                0            1             0
12                0            1             0

In [4]:
merged = pd.concat([df,dummies],axis = 1)
merged.drop(columns = ['town','west windsor'],axis = 1,inplace = True)

In [5]:
merged

    area   price  monroe township  robinsville
0   2600  550000                1            0
1   3000  565000                1            0
2   3200  610000                1            0
3   3600  680000                1            0
4   4000  725000                1            0
5   2600  585000                0            0
6   2800  615000                0            0
7   3300  650000                0            0
8   3600  710000                0            0
9   2600  575000                0            1
10  2900  600000                0            1
11  3100  620000                0            1
12  3600  695000                0            1

In [6]:
from sklearn.linear_model import LinearRegression

In [7]:
model = LinearRegression()
x = merged.drop(columns = 'price')
y = merged.price

In [8]:
model.fit(x,y)

LinearRegression()

In [9]:
model.predict([[3400,0,0]])
model.score(x,y)

0.9573929037221873

In [10]:
from sklearn.preprocessing import LabelEncoder
le = LabelEncoder()

In [11]:
dfle = df
dfle.town = le.fit_transform(dfle.town)

In [12]:
x = dfle[['town','area']].values
y = dfle.price

In [13]:
from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder
ohe = ColumnTransformer(
    transformers=[("town",OneHotEncoder(categories='auto'), [0])],remainder='passthrough' 
)
x = ohe.fit_transform(x)

In [14]:
x = x[:,1:] 
model = LinearRegression()
model.fit(x,y)

LinearRegression()

In [15]:
model.predict([[0,2600,28000]])

array([1.07799241e+08])

Exercise

In [16]:
df = pd.read_csv('carprices.csv')
df

                Car Model  Mileage  Sell Price($)  Age(yrs)
0                  BMW X5    69000          18000         6
1                  BMW X5    35000          34000         3
2                  BMW X5    57000          26100         5
3                  BMW X5    22500          40000         2
4                  BMW X5    46000          31500         4
5                 Audi A5    59000          29400         5
6                 Audi A5    52000          32000         5
7                 Audi A5    72000          19300         6
8                 Audi A5    91000          12000         8
9   Mercedez Benz C class    67000          22000         6
10  Mercedez Benz C class    83000          20000         7
11  Mercedez Benz C class    79000          21000         7
12  Mercedez Benz C class    59000          33000         5

In [17]:
dummy = pd.get_dummies(df['Car Model'])

In [18]:
merged = pd.concat([df,dummy],axis = 1)
merged.drop(columns = ['Car Model','Mercedez Benz C class'],inplace = True)

In [19]:
x = merged.drop(columns = 'Sell Price($)')
y = merged['Sell Price($)']
model = LinearRegression()
model.fit(x,y)

LinearRegression()

In [20]:
merged

    Mileage  Sell Price($)  Age(yrs)  Audi A5  BMW X5
0     69000          18000         6        0       1
1     35000          34000         3        0       1
2     57000          26100         5        0       1
3     22500          40000         2        0       1
4     46000          31500         4        0       1
5     59000          29400         5        1       0
6     52000          32000         5        1       0
7     72000          19300         6        1       0
8     91000          12000         8        1       0
9     67000          22000         6        0       0
10    83000          20000         7        0       0
11    79000          21000         7        0       0
12    59000          33000         5        0       0

In [21]:
model.predict([[45000,4,0,0]])

array([36991.31721061])

In [22]:
le = LabelEncoder()
dfle = df

In [23]:
dfle['Car Model'] = le.fit_transform(dfle['Car Model'])

In [24]:
x = dfle.drop(columns = 'Sell Price($)')
y = dfle['Sell Price($)']

In [26]:
# from sklearn.compose import ColumnTransformer
from sklearn.preprocessing import OneHotEncoder
ohe = ColumnTransformer(
    transformers = [('Car Model' , OneHotEncoder(categories = 'auto'), [0])] , remainder = 'passthrough'
)
x = ohe.fit_transform(x)

In [27]:
x = x[:,1:]
model.fit(x,y)
model.score(x,y)

0.9417050937281082